{"player": {"_name": "Newbie", "_level": 2, "_levelProgress": 17, "_nextLevel": 100, "_levelTable": [100, 50, 50, 25, 5, 5, 2, 2], "_health": 100, "_maxHealth": 100, "_mana": 50, "_maxMana": 50, "_damage": 5, "_defense": 2, "_accuracy": 100, "_shieldDuration": 0, "_inventory": {"Equipped": {"Weapon": "Wooden Sword", "Shield": "Wooden Shield"}, "Weapon": {"Fists": {"stats": {"Damage": 0}, "quantity": 1}, "Wooden Sword": {"stats": {"Damage": 5}, "quantity": 1}}, "Shield": {"Fists": {"stats": {"Defense": 0}, "quantity": 1}, "Wooden Shield": {"stats": {"Defense": 2}, "quantity": 1}}, "Consumable": {"Burrito": {"stats": {"Health": 15}, "quantity": 3}, "Block of Cheese": {"stats": {"Health": 5}, "quantity": 1}}}}, "tiles": {"template": {"_name": "", "_description": [""], "_directions": {"north": "", "east": "", "south": "", "west": ""}, "_combatEncounter": {"_name": "", "_startDescription": [""], "_enemies": {"enemyName": {"_level": 0, "_levelProgress": 0, "_nextLevel": 0, "_levelTable": [], "_health": 0, "_maxHealth": 0, "_mana": 0, "_maxMana": 0, "_damage": 0, "_accuracy": 0, "_inventory": {"Equipped": {"Weapon": "Fists", "Shield": "Fists"}, "Weapon": {"Fists": {"stats": {"Damage": 0}, "quantity": 1}, "Wooden Sword": {"stats": {"Damage": 5}, "quantity": 1}}, "Shield": {"Fists": {"stats": {"Defense": 0}, "quantity": 1}, "Wooden Shield": {"stats": {"Defense": 2}, "quantity": 1}}}, "quantity": 0}}}, "_endDescription": [""], "_triggerChance": [0, 0]}, "tile00": {"_name": "Beginning Plains", "_description": ["The grassy plain before you stretches out for miles, its lush green carpet broken only by the\noccasional wildflower or shrub. The gentle breeze carries with it the sweet scent of the blooming\nflora, and the warm sun envelops you in its comforting embrace. In the distance to the north, you\ncan see a cluster of small buildings, their thatched roofs and wooden walls standing out against the\nverdant landscape. A faint murmur of activity reaches your ears, indicating that the settlement is\nnot entirely deserted.", "To the east, the forest looms darkly, its dense canopy casting deep shadows across the ground. The\nair is noticeably cooler here, and the rustling of leaves and the occasional snap of a twig hint at\nthe presence of wildlife. It would be unwise to venture too far into the woods without proper\npreparation.", "To the south, the river roars tumultuously, its frothy white water churning over rocks and boulders.\nThe riverbank is steep and treacherous, offering no viable crossing points for miles. You can hear\nthe distant thunder of a waterfall somewhere upstream, and it's clear that the river's power and\nferocity cannot be underestimated.", "As you gaze westward, the grassy plain seems to stretch on endlessly, the horizon punctuated only by\nthe occasional hill or copse of trees. The landscape is peaceful and serene, yet there's a sense of\nuntamed wildness that pervades it, as if anything could happen at any moment."], "_directions": {"north": "tile01", "east": "", "south": "", "west": ""}, "_combatEncounter": {"_name": "", "_startDescription": [""], "_enemies": {}}, "_endDescription": [""], "_triggerChance": [0, 0]}, "tile01": {"_name": "Peaceful Clearing", "_description": ["You come across a small clearing in the midst of the grassy plain. The tall blades of grass give way\nto a flat expanse of earth, and the air is filled with the scent of damp earth and fresh grass. In\nthe center of the clearing, there's a large boulder, its rough surface weathered by years of\nexposure to the elements.", "Several trees encircle the boulder, their branches intermingling in a natural canopy that provides\nshade from the bright sun. A small stream flows nearby, its gentle babbling adding to the\ntranquility of the spot. The ground around the boulder is littered with fallen leaves and twigs, and\na few mushrooms have sprouted in the damp soil.", "As you pause to take in the peaceful scene, you notice the sound of birds chirping in the distance\nand the rustling of leaves as a light breeze passes through the trees. It's clear that this is a\nplace of respite, a natural oasis in the midst of the vast grasslands."], "_directions": {"north": "", "east": "", "south": "tile00", "west": ""}, "_combatEncounter": {"_name": "Ambush", "_startDescription": ["As you make your way through the plains, your peaceful reverie is abruptly shattered by the sudden\nappearance of two goblins. They emerge from behind a nearby rock, their beady eyes fixed on you with\na mixture of curiosity and hostility. The goblins are small, barely up to your waist, with green\nskin, pointy ears, and long, sharp teeth.", "As they step out of hiding, they brandish crude weapons made of wood and rusted metal, and let out a\nguttural snarl. You can see that they're clearly spoiling for a fight, their stance aggressive and\nthreatening."], "_enemies": {"Goblin": {"_level": 1, "_levelProgress": 0, "_nextLevel": 0, "_levelTable": [20, 10, 0, 0, 3, 3, 1, 1], "_health": 0, "_maxHealth": 0, "_mana": 0, "_maxMana": 0, "_damage": 0, "_accuracy": 50, "_inventory": {"Equipped": {"Weapon": "Crude Club", "Shield": "Fists"}, "Weapon": {"Crude Club": {"stats": {"Damage": 1}, "quantity": 1}}, "Shield": {"Fists": {"stats": {"Defense": 0}, "quantity": 1}}}, "quantity": 2}}, "_endDescription": ["The goblins lie motionless on the ground, their weapons clattering to the earth beside them. You\ntake a moment to catch your breath, your heart pounding with the adrenaline of the fight. You're\nglad to have emerged victorious, but you know that there may be more dangers ahead as you continue\non your journey towards the village."], "_triggerChance": [10, 10]}}}, "location": "tile01"}